Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: First point of line (supports floating-point coordinates).
it_it: Primo punto della linea (supporta coordinate in virgola mobile).

source: First use :cpp:expr:`lv_file_explorer_create(lv_screen_active())` to create a File Explorer.
it_it: Per prima cosa, si usa :cpp:expr:`lv_file_explorer_create(lv_screen_active())` per creare un File Explorer.

source: First use :cpp:expr:`lv_ime_pinyin_create(lv_screen_active())` to create a Pinyin input-method plug-in, then use :cpp:expr:`lv_ime_pinyin_set_keyboard(pinyin_ime, kb)` to add the Keyboard Widget you created to the Pinyin input method plug-in.
it_it: Per prima cosa, si usa :cpp:expr:`lv_ime_pinyin_create(lv_screen_active())` per creare un plug-in per il metodo di input Pinyin, poi si usa :cpp:expr:`lv_ime_pinyin_set_keyboard(pinyin_ime, kb)` per aggiungere il Widget Keyboard creato al plug-in per il metodo di input Pinyin.

source: First you need to describe the size of rows and columns.
it_it: Per prima cosa è necessario descrivere la dimensione di righe e colonne.

source: First you need to install the pre-requisites on your system
it_it: Per prima cosa si devono installare i prerequisiti sul sistema.

source: First, Download FreeType from the ``freetype2`` folder (and optionally ``freetype-docs`` and ``freetype-demos``) from its `official repository <https://sourceforge.net/projects/freetype/files/>`__.
it_it: Per prima cosa, scaricare FreeType dalla cartella ``freetype2`` (e facoltativamente ``freetype-docs`` e ``freetype-demos``) dal suo `repository ufficiale <https://sourceforge.net/projects/freetype/files/>`__.

source: First, a group needs to be created.
it_it: Innanzitutto, è necessario creare un gruppo.

source: First, according to the `Builroot Manual <https://buildroot.org/downloads/ manual/manual.html>`_, Buildroot requires certain packages to be installed before starting the build.
it_it: Innanzitutto, secondo il `suo manuale <https://buildroot.org/downloads/ manual/manual.html>`_, Buildroot richiede l'installazione di determinati pacchetti prima di avviare la compilazione.

source: First, call :cpp:expr:`lv_xml_test_run_init()` to prepare for executing the steps.
it_it: Per prima cosa, si chiama :cpp:expr:`lv_xml_test_run_init()` per preparare l'esecuzione dei passi.

source: First, create a layer and add it to the configuration file
it_it: Per prima cosa, si crea un layer e lo si aggiunge al file di configurazione.

source: First, download and install the LVGL Editor from `pro.lvgl.io <https://pro.lvgl.io/download>`_.
it_it: Per prima cosa, si scarica e si installa l'Editor LVGL da `pro.lvgl.io <https://pro.lvgl.io/download>`_.

source: First, enable :c:macro:`LV_USE_MONKEY` in ``lv_conf.h``.
it_it: Per prima cosa, si abilita :c:macro:`LV_USE_MONKEY` in ``lv_conf.h``.

source: First, set :c:macro:`LV_IME_PINYIN_USE_DEFAULT_DICT` to ``0`` in ``lv_conf.h``
it_it: Per prima cosa, impostare :c:macro:`LV_IME_PINYIN_USE_DEFAULT_DICT` a ``0`` in ``lv_conf.h``

source: Fit to screen
it_it: Adatta a schermo

source: Fits and runs within just 256k of code space and 16k of RAM. No OS is needed, although you can also run it with an OS, if you want.
it_it: Si adatta e funziona in soli 256 kB di spazio di codice e 16 kB di RAM. Non è necessario alcun sistema operativo, anche se è possibile eseguirlo anche con un sistema operativo, volendo.

source: Flags
it_it: I Flag

source: Flags for text rendering.
it_it: Flag per il rendering del testo.

source: Flags like *Clickable*, *Scrollable*, etc.
it_it: Flag come *Clickable*, *Scrollable*, ecc.

source: Flash the image
it_it: Eseguire il flashing dell'immagine

source: Flash/ROM: > 64 kB for the very essential components (> 180 kB is recommended)
it_it: Flash/ROM: >64 kB per i componenti essenziali (>180 kB consigliati)

source: Flashing the firmware in the board using OpenOCD
it_it: Flashare il firmware sulla scheda usando OpenOCD

source: Flex align
it_it: Allineamento Flex

source: Flex and Grid layouts can also stretch widgets to control both position and size.
it_it: I layout Flex e Grid possono anche allungare i widget per controllarne sia la posizione che le dimensioni.

source: Flex flow
it_it: Flusso Flex

source: Flex grow can be set on a child Widget with :cpp:expr:`lv_obj_set_flex_grow(child, value)`.
it_it: Flex grow può essere impostato su un Widget figlio con :cpp:expr:`lv_obj_set_flex_grow(child, value)`.

source: Flex grow can be used to make one or more children fill available space in the track.
it_it: Flex grow [crescita] può essere utilizzato per far sì che uno o più widget figlio occupino lo spazio disponibile nella track.

source: Flex layout properties.
it_it: Proprietà del layout Flex.

source: Flexbox: arranges child Widgets into rows or columns, with support for wrapping and expanding items.
it_it: Flexbox: organizza i Widget secondari in righe o colonne, con supporto per il wrapping e l'espansione degli elementi.

source: Flexible background rendering:
it_it: Rendering del background flessibile:

source: Flexible: Berry is a dynamic type script, and it's intended for embedding in applications.
it_it: Flessibile: Berry è uno script di tipo dinamico ed è progettato per l'integrazione nelle applicazioni.

source: Floating button
it_it: Pulsante mobile

source: Flush Callback
it_it: Callback Flush

source: Flush-Wait Callback
it_it: Callback Flush-Wait

source: Focusable Widgets
it_it: Widget con Focus

source: Focusing on what is best for the community
it_it: Concentrarsi su ciò che è meglio per la comunità

source: Follow the OpenGL ES driver setup documentation (:ref:`opengl_driver`) to configure a driver that supports OpenGL for your platform.
it_it: Seguire la documentazione di configurazione del driver OpenGL ES (:ref:`opengl_driver`) er configurare un driver che supporti OpenGL per la propria piattaforma.

source: Follow the README.md files in those repos for specific instructions to get started with them.
it_it: Seguire i file README.md in quei repository per istruzioni specifiche su come iniziare a utilizzarli.

source: Follow the generic instructions for getting started with LVGL.
it_it: Seguire le istruzioni generiche per iniziare a usare LVGL.

source: Follow the instructions in :ref:`file_system`.
it_it: Seguire le istruzioni in :ref:`file_system`.

source: Follow the instructions in the project README.md to build and flash the project to the board.
it_it: Seguire le istruzioni nel file README.md del progetto per compilare e flashare il progetto sulla board.

source: Follow the instructions in the project README.md to flash the board bootloader and obtain the Yocto SD Card image and SDK (pre-built or custom-built), build, and upload the project to the board.
it_it: Seguire le istruzioni nel file README.md del progetto per flashare il bootloader della scheda e ottenere l'immagine della scheda SD Yocto e l'SDK (pre-compilati o personalizzati), compilare e caricare il progetto sulla scheda.

source: Follow the instructions in the project README.md to obtain the SD Card image and toolchain installer, build, and upload the project to the board.
it_it: Seguire le istruzioni nel file README.md del progetto per ottenere l'immagine della scheda SD e il programma di installazione della toolchain, compilare e caricare il progetto sulla scheda.

source: Follow the instructions in the readme to get started.
it_it: Seguire le istruzioni nel file readme per iniziare.

source: Follow the official GStreamer documentation to install its development libraries on your system: https://gstreamer.freedesktop.org/documentation/installing/index.html?gi-language=c
it_it: Seguire la documentazione ufficiale di GStreamer per installare le sue librerie di sviluppo sul proprio sistema: https://gstreamer.freedesktop.org/documentation/installing/index.html?gi-language=c

source: Follow the official bring-up `guides <https://developer.toradex.com/quickstart/bringup/>`_.
it_it: Seguire le `guide <https://developer.toradex.com/quickstart/bringup/>`_ ufficiali di avvio.

source: Following this structure, create a folder containing the recipes to build 1 or multiple applications using lvgl
it_it: Seguendo questa struttura, si crea una cartella contenente le ricette per compilare una o più applicazioni utilizzando lvgl.

source: Font Engines
it_it: Motori dei Font

source: Font Support
it_it: Supporto per i Font

source: Font format, size, and count limit.
it_it: Formato, dimensione e limite di conteggio del font.

source: Font resource concatenation (font fallback).
it_it: Concatenazione delle risorse dei font (font alternativi).

source: Font resource recycling mechanism (buffers recently deleted font resources to reduce the time overhead of repeated creation).
it_it: Meccanismo di riciclo delle risorse font (memorizza nel buffer le risorse font eliminate di recente per ridurre il tempo di creazione ripetuto).

source: Font resource reference counting (reduces repeated creation of font resources).
it_it: Conteggio dei riferimenti alle risorse font (riduce la creazione ripetuta di risorse font).

source: Font size in px (e.g., "12")
it_it: Dimensione del font in px (ad esempio, "12")

source: Font to use, with support for fallback fonts.
it_it: Font da utilizzare, con supporto per font alternativi.

source: Fonts
it_it: Font

source: Fonts (lv_font)
it_it: Font (lv_font)

source: Fonts and Images are registered automatically when ``globals.xml`` is registered.
it_it: Font e immagini vengono registrati automaticamente quando ``globals.xml`` viene registrato.

source: Fonts have a **format** property.
it_it: I font hanno una proprietà **format**.

source: Fonts must be registered before any XML files referencing them are registered, so that the font data is already known.
it_it: I font devono essere registrati prima di qualsiasi file XML che vi faccia riferimento, in modo che i dati del font siano già noti.

source: Fonts used directly from a TTF file can be listed in the ``<fonts>`` section of ``globals.xml``.
it_it: I font utilizzati direttamente da un file TTF possono essere elencati nella sezione ``<fonts>`` di ``globals.xml``.

source: Fonts usually provide kerning information to adjust the spacing between specific characters.
it_it: I font solitamente forniscono informazioni sul kerning per regolare la spaziatura tra caratteri specifici.

source: Footer buttons so added are evenly spaced and centered.
it_it: I pulsanti del piè di pagina così aggiunti sono equidistanti e centrati.

source: For :c:macro:`LV_LOG_USER` to produce output, the following needs to be true in ``lv_conf.h``:
it_it: Affinché :c:macro:`LV_LOG_USER` produca un output, in ``lv_conf.h`` deve essere soddisfatta la seguente condizione:

source: For :cpp:enumerator:`LV_COLOR_FORMAT_A8`, this will be the visible pixels' color.
it_it: Per :cpp:enumerator:`LV_COLOR_FORMAT_A8`, questo sarà il colore dei pixel visibili.

source: For BAR and STACKED charts ``pad_column`` sets the space between bars in the same data series.
it_it: Per i grafici BAR e STACKED ``pad_column`` imposta lo spazio tra le barre nella stessa serie di dati.

source: For Components, no setters are created, but all the parameters are passed to the create function.
it_it: Per i componenti, non vengono creati "setter", ma tutti i parametri vengono passati alla funzione "create".

source: For Developers
it_it: Per gli Sviluppatori

source: For Embedded Devices
it_it: Per i Dispositivi Embedded

source: For LINE-, BAR-, STACKED-charts, this is the number of points on the X axis.
it_it: Per i grafici LINE, BAR, STACKED, questo è il numero di punti sull'asse X.

source: For LVGL development and testing, it may be useful to use LVGL as a local component instead of from the ESP Registry, which offers only released versions and does not allow local modifications.
it_it: Per lo sviluppo e il test di LVGL, potrebbe essere utile utilizzare LVGL come componente locale anziché dall'ESP Registry, che offre solo versioni rilasciate e non consente modifiche locali.

source: For LVGL documentation, use the section-heading convention presented below.
it_it: Per la documentazione LVGL, utilizzare la convenzione per le intestazioni di sezione presentata di seguito.

source: For LVGL's time-related tasks to be reliable, the time updates via the Tick Interface must be reliable and the Tick Value must appear atomic to LVGL.
it_it: Affinché i task LVGL relativi al tempo siano affidabili, gli aggiornamenti temporali tramite la "Tick Interface" devono essere affidabili e il "Tick Value" deve apparire atomico a LVGL.

source: For SCATTER charts, this is the number of scatter-points in the data series.
it_it: Per i grafici a dispersione, questo è il numero di punti a dispersione nella serie di dati.

source: For SCATTER-type charts,
it_it: Per i grafici di tipo SCATTER,

source: For Screens
it_it: Per gli Screen

source: For Screens, the preview options are defined in ``project.xml``.
it_it: Per gli Screen, le opzioni di anteprima sono definite in ``project.xml``.

source: For UNIX
it_it: Per UNIX

source: For UNIX-like systems, the following is recommended to compile and install FreeType libraries.
it_it: Per i sistemi UNIX-like, si consiglia di compilare e installare le librerie FreeType come segue.

source: For WEBP files, follow the instructions in :ref:`libwebp`.
it_it: Per i file WEBP, seguire le istruzioni in :ref:`libwebp`.

source: For Widgets, the :ref:`layers_creation` creates a natural layering (Z-order) of Widgets sharing the same parent.
it_it: Per i Widgets, :ref:`layers_creation` crea un "layering" [stratificazione] naturale (ordine Z) di Widget che condividono lo stesso elemento padre.

source: For Zephyr versions 3.7.0 and below, additional options are available to manage LVGL's frame flushing:
it_it: Per le versioni di Zephyr 3.7.0 e precedenti, sono disponibili opzioni aggiuntive per gestire il flushing dei frame LVGL:

source: For ``0xf287`` the *Hex UTF-8 bytes* are ``EF 8A 87``.
it_it: Per ``0xf287`` i byte *Hex UTF-8* sono ``EF 8A 87``.

source: For ``<widget>``\ s, timelines are supported only in LVGL's UI Editor, where C code can also be exported from them.
it_it: Per i ``<widget>``, le timeline sono supportate solo nell'Editor dell'Interfaccia utente di LVGL, da cui è possibile esportare anche il codice C.

source: For ``file_p``, LVGL passes the return value of ``open_cb``, ``buf`` is the data to write, ``btw`` is the number of "bytes to write", ``bw`` is the number of "bytes written" (written to during the function call).
it_it: Per ``file_p``, LVGL passa il valore di ritorno di ``open_cb``, ``buf`` sono i dati da scrivere, ``btw`` è il numero di "byte da scrivere", ``bw`` è il numero di "byte scritti" (scritti durante la chiamata alla funzione).

source: For a BMP file, follow the instructions in :ref:`bmp`.
it_it: Per un file BMP, seguire le istruzioni in :ref:`bmp`.

source: For a SCATTER chart, within each series, points later in the sequence will appear on top of points earlier in the sequence when there is overlap.
it_it: Per un grafico a dispersione, all'interno di ogni serie, i punti successivi nella sequenza appariranno sopra i punti precedenti nella sequenza in caso di sovrapposizione.

source: For a Scale in one of the ``..._ROUND_...`` modes, you can optionally get it to rotate the major-tick labels to match the rotation of the major ticks using :cpp:expr:`lv_obj_set_style_transform_rotation(scale, LV_SCALE_LABEL_ROTATE_MATCH_TICKS, LV_PART_INDICATOR)`.
it_it: Per una "Scale" in una delle modalità ``..._ROUND_...``, è possibile far ruotare le etichette dei tick principali in modo che corrispondano alla rotazione degli stessi utilizzando :cpp:expr:`lv_obj_set_style_transform_rotation(scale, LV_SCALE_LABEL_ROTATE_MATCH_TICKS, LV_PART_INDICATOR)`.

source: For a detailed introduction to glTF, see: https://www.khronos.org/gltf/
it_it: Per un'introduzione dettagliata a glTF, vedere: https://www.khronos.org/gltf/

source: For a detailed introduction, see:
it_it: Per un'introduzione dettagliata, vedere:

source: For a detailed introduction, see: http://www.libpng.org/pub/png/libpng.html .
it_it: Per un'introduzione dettagliata, consultare: http://www.libpng.org/pub/png/libpng.html .

source: For a detailed introduction, see: https://freetype.org/ .
it_it: Per un'introduzione dettagliata, consultare: https://freetype.org/.

source: For a detailed introduction, see: https://github.com/littlefs-project/littlefs .
it_it: Per un'introduzione dettagliata, vedere: https://github.com/littlefs-project/littlefs .

source: For a detailed introduction, see: https://github.com/lvandeve/lodepng .
it_it: Per un'introduzione dettagliata, vedere: https://github.com/lvandeve/lodepng .

source: For a detailed introduction, see: https://github.com/nothings/stb.
it_it: Per un'introduzione dettagliata, vedere: https://github.com/nothings/stb.

source: For a detailed introduction, see: https://libjpeg-turbo.org .
it_it: Per un'introduzione dettagliata, vedere: https://libjpeg-turbo.org .

source: For a detailed introduction, see: https://www.ffmpeg.org
it_it: Per un'introduzione dettagliata, consultare: https://www.ffmpeg.org

source: For a detailed introduction, see: https://www.w3.org/TR/SVGTiny12/
it_it: Per un'introduzione dettagliata, consultare: https://www.w3.org/TR/SVGTiny12/

source: For a detailed introduction, see: `TJpgDec <http://elm-chan.org/fsw/tjpgd/>`__.
it_it: Per un'introduzione dettagliata, vedere: `TJpgDec <http://elm-chan.org/fsw/tjpgd/>`__.

source: For a detailed overview of EGL usage and configuration, see :ref:`egl_driver`.
it_it: Per una panoramica dettagliata dell'utilizzo e della configurazione di EGL, consultare :ref:`egl_driver`.

source: For a list of prototypes for these callbacks see `lv_fs_template.c <https://github.com/lvgl/lvgl/blob/master/examples/porting/lv_port_fs_template.c>`__.
it_it: Per un elenco di prototipi per queste callback, vedere `lv_fs_template.c <https://github.com/lvgl/lvgl/blob/master/examples/porting/lv_port_fs_template.c>`__.

source: For a quick start with LVGL and ESP32, the LVGL maintains an demo project compatible to several ESP32 boards under its `LV Port for ESP32 <https://github.com/lvgl/lv_esp_idf>`.
it_it: Per un rapido avvio con LVGL ed ESP32, LVGL gestisce un progetto demo compatibile con diverse schede ESP32 nel suo `Porting LV per ESP32 <https://github.com/lvgl/lv_esp_idf>`.

source: For a reference implementation of a draw unit, see `lv_draw_sw.c <https://github.com/lvgl/lvgl/blob/master/src/draw/sw/lv_draw_sw.c>`__.
it_it: Per un'implementazione di riferimento di una draw unit, vedere `lv_draw_sw.c <https://github.com/lvgl/lvgl/blob/master/src/draw/sw/lv_draw_sw.c>`__.

source: For a start, their products are not evaluation boards.
it_it: Innanzitutto, i loro prodotti non sono "evaluation board".

source: For a successful LVGL project, you will need a display driver and optionally a touch driver.
it_it: Per un progetto LVGL di successo, è necessario un driver per il display e, facoltativamente, un driver per il touch.

source: For a summary of coding conventions to follow see the :ref:`coding-style`.
it_it: Per un riepilogo delle convenzioni di codifica da seguire, consultare :ref:`coding-style`.

source: For additional details and a working example see the :ref:`generic MIPI driver` documentation.
it_it: Per ulteriori dettagli e un esempio funzionante, consultare la documentazione del :ref:`driver MIPI generico`.

source: For advanced features not covered in this guide, please consult the `Buildroot manual <https://buildroot.org/downloads/manual/manual.html>`_
it_it: Per funzionalità avanzate non trattate in questa guida, consultare il `Manuale di Buildroot <https://buildroot.org/downloads/manual/manual.html>`_

source: For advanced formats, the font information is stored in its respective format.
it_it: Per i formati avanzati, le informazioni sul font vengono memorizzate nel rispettivo formato.

source: For all its faults, when running right-sized animations, they provide a wonderful utility to LVGL on embedded LCDs and can look really good when done properly.
it_it: Nonostante tutti i loro difetti, quando si eseguono animazioni di dimensioni corrette, forniscono una meravigliosa utilità per LVGL su LCD embedded e possono avere un aspetto davvero gradevole se eseguite correttamente.

source: For all of the ``lv_..._bind_...()`` functions covered below, they are similar to :cpp:expr:`lv_subject_add_observer_obj(&some_subject, some_observer_cb, widget, user_data)` in that they create an Observer and associates the Widget with it.
it_it: Tutte le funzioni ``lv_..._bind_...()`` descritte di seguito sono simili a :cpp:expr:`lv_subject_add_observer_obj(&some_subject, some_observer_cb, widget, user_data)` in quanto creano un Observer e vi associano il Widget.

source: For an example of how draw-unit creation and initialization is done, see :cpp:func:`lv_draw_sw_init` in lv_draw_sw.c_ or the other draw units whose ``init`` functions are optionally called in :cpp:func:`lv_init`.
it_it: Per un esempio di come vengono eseguite la creazione e l'inizializzazione delle unità di disegno, vedere :cpp:func:`lv_draw_sw_init` in lv_draw_sw.c_ o le altre unità di disegno le cui funzioni ``init`` sono facoltativamente chiamate in :cpp:func:`lv_init`.

source: For an example of what *not* to do: this can "seem" to work, but LVGL's timing will be incorrect because the execution time of :cpp:func:`lv_timer_handler` varies from call to call and thus the delay it introduces cannot be known.
it_it: Ecco un esempio di cosa *non* fare: questo può "sembrare" funzionare, ma la temporizzazione di LVGL sarà errata perché il tempo di esecuzione di :cpp:func:`lv_timer_handler` varia da chiamata a chiamata e quindi il ritardo introdotto non può essere noto.

source: For any package you wish to add, these dependencies must be met; otherwise, the option will remain hidden.
it_it: Per qualsiasi pacchetto che si desidera aggiungere, queste dipendenze devono essere soddisfatte; in caso contrario, l'opzione rimarrà nascosta.

source: For applications that don't need decorations (fullscreen, kiosk mode, etc.), simply create your UI without them.
it_it: Per le applicazioni che non necessitano di decorazioni (schermo intero, modalità kiosk, ecc.), si può semplicemente creare l'interfaccia utente senza di esse.

source: For best performance, choose "release".
it_it: Per prestazioni ottimali, scegliere "release".

source: For better performance, enable ``LTO`` (Link Time Optimization) and use ``-Omax`` or ``-Ofast``.
it_it: Per prestazioni migliori, abilitare ``LTO`` (Link Time Optimization) e usare ``-Omax`` o ``-Ofast``.

source: For both the center and edge coordinates, ``px`` or ``lv_pct()`` values can be used.
it_it: Per le coordinate del centro e del bordo, è possibile utilizzare i valori ``px`` o ``lv_pct()``.

source: For callback details, see :cpp:type:`lv_draw_glyph_cb_t`.
it_it: Per i dettagli sulla callback, vedere :cpp:type:`lv_draw_glyph_cb_t`.

source: For cases when the `esp_bsp` is not being used, it is possible to invoke the ESP-LVGL port directly:
it_it: Nei casi in cui `esp_bsp` non viene utilizzato, è possibile richiamare direttamente la porta ESP-LVGL:

source: For character-specific drawing in draw units, use :cpp:expr:`lv_draw_label_iterate_characters(draw_unit, draw_dsc, area, callback)`.
it_it: Per il disegno di caratteri specifici in unità di disegno, si usa :cpp:expr:`lv_draw_label_iterate_characters(draw_unit, draw_dsc, area, callback)`.
